//
//  CarouselViewModel.swift
//  CardViewStudy
//
//  Created by 김경호 on 2023/05/31.
//

import SwiftUI

class CarouselViewModel: ObservableObject{
    @Published var cards = [
        Card(cardId: "2210", image: Image("card"), title: "블랙핑크 카드", content:
                "건강 보험 임신&middot;출산 진료비 지원- 임신 &middot; 출산이 확인된 건강보험 가입자 또는 피부양자 등에게 임신과 출산에 관련된 진료 비용 60만원(다태아:100만원) 지원청소년산모 임신&middot;출산 의료비 지원&nbsp;- 만 18세 이하 산모 대상으로 임신과 출산에 관련된 진료 비용 지원보육료&middot;유아학비&nbsp;지원- 만 0세부터 5세 아동 대상 어린이집, 유치원 보육료 및 유아학비 지원산모&middot;신생아&nbsp;건강관리&nbsp;지원-&nbsp;산모 또는 배우자가 국민기초생활 보장법에 따른 생계&middot;의료&middot;주거&middot;교육급여 수급자 또는 차상위 계층에 해당하는 출산가정 등을 대상으로 산모 및 신생아의 건강관리 돌봄서비스 제공 기저귀&middot;조제분유&nbsp;지원- 보건복지부 지원대상 가구의 기저귀, 조제분유 구매 지원사업(만 2세 미만 영아 대상, 보건소를 통한 바우처 신청 후 지원결정 통보 익일부터 바우처 사용 가능)여성청소년&nbsp;위생용품&nbsp;바우처&nbsp;지원- 차상위계층 등의 여성청소년을 대상으로 위생용품 구입비용을 지원하는 바우처기타&nbsp;사회&nbsp;서비스&nbsp;사업- 노인 돌봄 종합 서비스, 장애인 활동지원 등 기타 사회 서비스 사업에너지&nbsp;바우처&nbsp;지원- 에너지 취약 계층의 전기, 난방비 등을 지원하는 산업통상자원부 바우처 사업아이돌봄&nbsp;서비스&nbsp;지원- 가정의 아이돌봄을 지원하여 아이 및 보호자의 복지 증진을 위한 바우처 사업* 바우처에 대한 세부 설명은 http://www.voucher.go.kr 에서 확인 가능합니다.", company: "BC CARD"),
        Card(cardId: "1278", image: Image("card2"), title: "국민행복카드", content:
                "건강 보험 임신&middot;출산 진료비 지원- 임신 &middot; 출산이 확인된 건강보험 가입자 또는 피부양자 등에게 임신과 출산에 관련된 진료 비용 60만원(다태아:100만원) 지원청소년산모 임신&middot;출산 의료비 지원&nbsp;- 만 18세 이하 산모 대상으로 임신과 출산에 관련된 진료 비용 지원보육료&middot;유아학비&nbsp;지원- 만 0세부터 5세 아동 대상 어린이집, 유치원 보육료 및 유아학비 지원산모&middot;신생아&nbsp;건강관리&nbsp;지원-&nbsp;산모 또는 배우자가 국민기초생활 보장법에 따른 생계&middot;의료&middot;주거&middot;교육급여 수급자 또는 차상위 계층에 해당하는 출산가정 등을 대상으로 산모 및 신생아의 건강관리 돌봄서비스 제공 기저귀&middot;조제분유&nbsp;지원- 보건복지부 지원대상 가구의 기저귀, 조제분유 구매 지원사업(만 2세 미만 영아 대상, 보건소를 통한 바우처 신청 후 지원결정 통보 익일부터 바우처 사용 가능)여성청소년&nbsp;위생용품&nbsp;바우처&nbsp;지원- 차상위계층 등의 여성청소년을 대상으로 위생용품 구입비용을 지원하는 바우처기타&nbsp;사회&nbsp;서비스&nbsp;사업- 노인 돌봄 종합 서비스, 장애인 활동지원 등 기타 사회 서비스 사업에너지&nbsp;바우처&nbsp;지원- 에너지 취약 계층의 전기, 난방비 등을 지원하는 산업통상자원부 바우처 사업아이돌봄&nbsp;서비스&nbsp;지원- 가정의 아이돌봄을 지원하여 아이 및 보호자의 복지 증진을 위한 바우처 사업* 바우처에 대한 세부 설명은 http://www.voucher.go.kr 에서 확인 가능합니다.", company: "KB"),
        Card(cardId: "2210", image: Image("card"), title: "블랙핑크 카드", content:
                "건강 보험 임신&middot;출산 진료비 지원- 임신 &middot; 출산이 확인된 건강보험 가입자 또는 피부양자 등에게 임신과 출산에 관련된 진료 비용 60만원(다태아:100만원) 지원청소년산모 임신&middot;출산 의료비 지원&nbsp;- 만 18세 이하 산모 대상으로 임신과 출산에 관련된 진료 비용 지원보육료&middot;유아학비&nbsp;지원- 만 0세부터 5세 아동 대상 어린이집, 유치원 보육료 및 유아학비 지원산모&middot;신생아&nbsp;건강관리&nbsp;지원-&nbsp;산모 또는 배우자가 국민기초생활 보장법에 따른 생계&middot;의료&middot;주거&middot;교육급여 수급자 또는 차상위 계층에 해당하는 출산가정 등을 대상으로 산모 및 신생아의 건강관리 돌봄서비스 제공 기저귀&middot;조제분유&nbsp;지원- 보건복지부 지원대상 가구의 기저귀, 조제분유 구매 지원사업(만 2세 미만 영아 대상, 보건소를 통한 바우처 신청 후 지원결정 통보 익일부터 바우처 사용 가능)여성청소년&nbsp;위생용품&nbsp;바우처&nbsp;지원- 차상위계층 등의 여성청소년을 대상으로 위생용품 구입비용을 지원하는 바우처기타&nbsp;사회&nbsp;서비스&nbsp;사업- 노인 돌봄 종합 서비스, 장애인 활동지원 등 기타 사회 서비스 사업에너지&nbsp;바우처&nbsp;지원- 에너지 취약 계층의 전기, 난방비 등을 지원하는 산업통상자원부 바우처 사업아이돌봄&nbsp;서비스&nbsp;지원- 가정의 아이돌봄을 지원하여 아이 및 보호자의 복지 증진을 위한 바우처 사업* 바우처에 대한 세부 설명은 http://www.voucher.go.kr 에서 확인 가능합니다.", company: "BC CARD"),
        Card(cardId: "1278", image: Image("card2"), title: "국민행복카드", content:
                "건강 보험 임신&middot;출산 진료비 지원- 임신 &middot; 출산이 확인된 건강보험 가입자 또는 피부양자 등에게 임신과 출산에 관련된 진료 비용 60만원(다태아:100만원) 지원청소년산모 임신&middot;출산 의료비 지원&nbsp;- 만 18세 이하 산모 대상으로 임신과 출산에 관련된 진료 비용 지원보육료&middot;유아학비&nbsp;지원- 만 0세부터 5세 아동 대상 어린이집, 유치원 보육료 및 유아학비 지원산모&middot;신생아&nbsp;건강관리&nbsp;지원-&nbsp;산모 또는 배우자가 국민기초생활 보장법에 따른 생계&middot;의료&middot;주거&middot;교육급여 수급자 또는 차상위 계층에 해당하는 출산가정 등을 대상으로 산모 및 신생아의 건강관리 돌봄서비스 제공 기저귀&middot;조제분유&nbsp;지원- 보건복지부 지원대상 가구의 기저귀, 조제분유 구매 지원사업(만 2세 미만 영아 대상, 보건소를 통한 바우처 신청 후 지원결정 통보 익일부터 바우처 사용 가능)여성청소년&nbsp;위생용품&nbsp;바우처&nbsp;지원- 차상위계층 등의 여성청소년을 대상으로 위생용품 구입비용을 지원하는 바우처기타&nbsp;사회&nbsp;서비스&nbsp;사업- 노인 돌봄 종합 서비스, 장애인 활동지원 등 기타 사회 서비스 사업에너지&nbsp;바우처&nbsp;지원- 에너지 취약 계층의 전기, 난방비 등을 지원하는 산업통상자원부 바우처 사업아이돌봄&nbsp;서비스&nbsp;지원- 가정의 아이돌봄을 지원하여 아이 및 보호자의 복지 증진을 위한 바우처 사업* 바우처에 대한 세부 설명은 http://www.voucher.go.kr 에서 확인 가능합니다.", company: "KB"),
        Card(cardId: "1278", image: Image("card2"), title: "국민행복카드", content:
                "건강 보험 임신&middot;출산 진료비 지원- 임신 &middot; 출산이 확인된 건강보험 가입자 또는 피부양자 등에게 임신과 출산에 관련된 진료 비용 60만원(다태아:100만원) 지원청소년산모 임신&middot;출산 의료비 지원&nbsp;- 만 18세 이하 산모 대상으로 임신과 출산에 관련된 진료 비용 지원보육료&middot;유아학비&nbsp;지원- 만 0세부터 5세 아동 대상 어린이집, 유치원 보육료 및 유아학비 지원산모&middot;신생아&nbsp;건강관리&nbsp;지원-&nbsp;산모 또는 배우자가 국민기초생활 보장법에 따른 생계&middot;의료&middot;주거&middot;교육급여 수급자 또는 차상위 계층에 해당하는 출산가정 등을 대상으로 산모 및 신생아의 건강관리 돌봄서비스 제공 기저귀&middot;조제분유&nbsp;지원- 보건복지부 지원대상 가구의 기저귀, 조제분유 구매 지원사업(만 2세 미만 영아 대상, 보건소를 통한 바우처 신청 후 지원결정 통보 익일부터 바우처 사용 가능)여성청소년&nbsp;위생용품&nbsp;바우처&nbsp;지원- 차상위계층 등의 여성청소년을 대상으로 위생용품 구입비용을 지원하는 바우처기타&nbsp;사회&nbsp;서비스&nbsp;사업- 노인 돌봄 종합 서비스, 장애인 활동지원 등 기타 사회 서비스 사업에너지&nbsp;바우처&nbsp;지원- 에너지 취약 계층의 전기, 난방비 등을 지원하는 산업통상자원부 바우처 사업아이돌봄&nbsp;서비스&nbsp;지원- 가정의 아이돌봄을 지원하여 아이 및 보호자의 복지 증진을 위한 바우처 사업* 바우처에 대한 세부 설명은 http://www.voucher.go.kr 에서 확인 가능합니다.", company: "KB")
    ]
    
    @Published var swipedCard = 0
    
    // Detail Content....
    
    @Published var showCard = false
    @Published var selectedCard = Card(cardId: "", image: Image("card"), title: "", content: "", company: "")
    @Published var selectedColor : Color = .clear
    @Published var showContent = false
    
    
}
