//
//  CarouselViewModel.swift
//  CardViewStudy
//
//  Created by 김경호 on 2023/05/31.
//

import SwiftUI

class CarouselViewModel: ObservableObject{
    @Published var cards = [
        Card(cardId: "2210", image: Image("card"), title: "블랙핑크 카드", content:
                [["85":"[FANDOM] 팬덤 10% 청구할인 - 앱 결제: 구글플레이, 앱스토어 * 앱스토어: App Store, Apple Music, iCloud * 국내 Google Play, Apple Services에 등록하여 결제 시 혜택 적용 * Google Play: 계정 - '국가 및 프로필' 내 국가를 대한민국으로 설정 * Apple Services: App Store 계정 * '국가/지역'을 대한민국으로 설정 * 해외 승인으로 거래 시 할인 적용 제외 - 팬덤: 더 세임(the SameE), 위버스샵 - 음반/서적: 교보문고, 교보핫트랙스, 영풍문고, 예스24, 알라딘 - 스트리밍: 넷플릭스. 유튜브프리미엄, 멜론, 지니뮤직, 벅스 * 대상가맹점 공식 홈페이지(앱)을 통해 직접 신청한 이용 건에 한하여 할인 제공(구글플레이, 앱스터오, 1회성 일반 구매 결제, 앱마켓 결제 등 할인 혜택 제외) * 넷플릭스의 경우 Basic, Standard, Premium 요금제에 한하여 할인 적용 - 티켓: 옥션티켓, 페이북공연 - 공식 홈페이지/앱/가맹점 내 결제건에 한하며, 타사 또는 제휴사이트를 통한 결제건은 할인 제외됩니다."],
                 ["16":
                    "[SHOPPING] 쇼핑 10% 청구할인 - 편의점: GS25, CU * 대형 유통점 등 입점 매장은 할인 제외됩니다. * 오프라인 매장 결제시에만 할인 적용됩니다. - 백화점: 일반백화점, 자사카드발행백화점 업종 * 오프라인 매장 결제시에만 할인 적용됩니다. - H&B 스토어: 올리브영, 다이소 * 다이소: 오프라인 매장 결제 시에만 할인 적용됩니다.(온라인 제외) - 멤버십: 네이버플러스멤버십, 쿠팡로켓와우 - 선물하기: 카카오톡 선물하기 * 상품권 구매건은 제외됩니다. - 공식 홈페이지/앱/가맹점 내 결제건에 한하며, 타사 또는 제휴사이트를 통한 결제건은 할인 제외됩니다."],
                 ["154":"[LIFE] 생활 10% 청구할인- 게임: 넥슨캐시 * 대상 가맹점: 넥슨캐시 온라인 충전금액(모바일 충전금액 제외) * 넥슨닷컴:(www.nexon.com) 내 넥슨 캐시 충전페이지를 통해 충전된 금액에 한하여 적용됩니다. * 모바일에서 충전하신 금액은 할인 대상에서 제외됩니다.- 이미용: 이용원, 미용원 업종- 대중교통: 버스, 지하철(후불교통)- 배달: 배달의 민족, 요기요, 쿠팡이츠 * 공식 홈페이지/앱/가맹점 내 결제 건에 한하며, 타사 또는 제휴사이트를 통한 결제건 및 현장 결제의 경우 할인 제외됩니다. * 배달 서비스 이용 시 혜택 적용되며, 배달 앱 내 상품권 구매 및 배달 서비스 이용 시 혜택 적용 제외됩니다."],
                 ["129":"[MOBILE] KT 단말기 할부대금 2~24개월 무이자 할부- KT대리점 및 KT온라인몰(KT샵)에서 휴대폰 구입 및 개통 시 제공됩니다.- 단말기 할부대금 5만원 이상 결제 시 제공됩니다.- KT 공식 대리점 및 콜센터, KT 홈페이지 및 앱 내 결제건에 한하며, 타사 또는 제휴사이트를 통한 결제 건은 적용 제외됩니다.- 전월실적 30만원 이상 시 제공"],
                 ["157":"[BRAND SERVICE] VISA Young Premium 서비스- 이 상품은 VISA Young Premium 서비스가 제공됩니다.- 국제 브랜드 서비스의 세부내용 및 유의사항은 국제 브랜드 홈페이지를 통해 확인하시기 바랍니다.- 본 서비스는 해외겸용(VISA)카드 발급 시에만 이용 가능합니다."],
                 ["28":"플레이트 디자인월 통합 할인한도- 전월실적 30만원 이상 시- 팬덤 서비스: 월 1만원 한도- 쇼핑 서비스: 월 1만원 한도- 생활 서비스: 월 1만원 한도서비스 제공 조건- 팬덤/쇼핑/생활/통신 할인 서비스는 카드 이용시점 기준 전월 1일부터 말일(매출 승인일)까지 국내외 가맹점 이용금액이 30만원 이상인 경우 제공됩니다. 단, 무승인 결제건(대중교통, 통신요금, 자동납부 등)의 경우 카드사에 접수된 매출전표 매입시점 기준으로 적용됩니다.- 상품권(선불카드 포함) 구매 및 충전금액 이용금액에 대해서는 할인 서비스가 적용되지 않습니다.- 월 통합 할인한도는 매월 1일에 생성되고 매월 말일에 소멸되며, 잔여통합 할인한도는 이월되지 않습니다.- 단기카드대출(현금서비스), 장기카드대출(카드론), 연회비, 각종 수수료/이자(할부수수료, SMS이용수수료, 카드대출이자등), 연체료, 제세공과금(건강보험/국민연금/고용보험/산재보험. 장애인고용부담금, 국세/지방세/관세, 전기요금, 우편요금, 도시가스요금,. 상하수도요금. 여권발급비용, 과태료, 범칙금, 벌금, 국가·공공기관·공공단체에서 개설한 가맹점 이용금액), 초·중·고등학교 학교납입금, 대학등록금, 아파트관리비, 기프트/선불카드(포인트, 사이버머니 등 전자지급수단 포함) 구매 및 충전, 상품권 구매, 팬덤/쇼핑/생활 할인 서비스가 적용된 원 매출 금액은 전월실적에 포함하지 않습니다.- 모든 할인 서비스의 할인 금액은 지정한 카드 결제일에 차감됩니다.- 카드 승인 취소 시 매출전표가 접수된 월의 이용실적에서 차감되며, 할인 적용 매출건을 취소하는 경우 할인 받은 금액은 반환(청구)처리됩니다.- 모든 서비스는 BC카드에 등록된 업종/가맹점 기준을 따릅니다.- 네이버페이, 카카오페이 등 각종 간편결제를 통해 결제 시 할인이 적용되지 않습니다.- 월 통합 할인한도는 매출이 정상 처리되는 순서대로 차감됩니다.- 최초 카드사용등록일로부터 다음 달 말일까지는 카드 이용금액과 관계없이 최소 실적 구간의 서비스를 제공합니다.- 가족카드의 경우 본인카드 이용실적과 합산되지 않으며, 카드별 이용 실적을 각각 체크하여 서비스가 제공됩니다."]
                ], company: "BC CARD"),
        Card(cardId: "1278", image: Image("card2"), title: "국민행복카드", content:
                [["14":"건강 보험 임신&middot;출산 진료비 지원- 임신 &middot; 출산이 확인된 건강보험 가입자 또는 피부양자 등에게 임신과 출산에 관련된 진료 비용 60만원(다태아:100만원) 지원청소년산모 임신&middot;출산 의료비 지원&nbsp;- 만 18세 이하 산모 대상으로 임신과 출산에 관련된 진료 비용 지원보육료&middot;유아학비&nbsp;지원- 만 0세부터 5세 아동 대상 어린이집, 유치원 보육료 및 유아학비 지원산모&middot;신생아&nbsp;건강관리&nbsp;지원-&nbsp;산모 또는 배우자가 국민기초생활 보장법에 따른 생계&middot;의료&middot;주거&middot;교육급여 수급자 또는 차상위 계층에 해당하는 출산가정 등을 대상으로 산모 및 신생아의 건강관리 돌봄서비스 제공 기저귀&middot;조제분유&nbsp;지원- 보건복지부 지원대상 가구의 기저귀, 조제분유 구매 지원사업(만 2세 미만 영아 대상, 보건소를 통한 바우처 신청 후 지원결정 통보 익일부터 바우처 사용 가능)여성청소년&nbsp;위생용품&nbsp;바우처&nbsp;지원- 차상위계층 등의 여성청소년을 대상으로 위생용품 구입비용을 지원하는 바우처기타&nbsp;사회&nbsp;서비스&nbsp;사업- 노인 돌봄 종합 서비스, 장애인 활동지원 등 기타 사회 서비스 사업에너지&nbsp;바우처&nbsp;지원- 에너지 취약 계층의 전기, 난방비 등을 지원하는 산업통상자원부 바우처 사업아이돌봄&nbsp;서비스&nbsp;지원- 가정의 아이돌봄을 지원하여 아이 및 보호자의 복지 증진을 위한 바우처 사업* 바우처에 대한 세부 설명은 http://www.voucher.go.kr 에서 확인 가능합니다."]], company: "KB"),
        Card(cardId: "2210", image: Image("card"), title: "블랙핑크 카드", content:
                [["14":"건강 보험 임신&middot;출산 진료비 지원- 임신 &middot; 출산이 확인된 건강보험 가입자 또는 피부양자 등에게 임신과 출산에 관련된 진료 비용 60만원(다태아:100만원) 지원청소년산모 임신&middot;출산 의료비 지원&nbsp;- 만 18세 이하 산모 대상으로 임신과 출산에 관련된 진료 비용 지원보육료&middot;유아학비&nbsp;지원- 만 0세부터 5세 아동 대상 어린이집, 유치원 보육료 및 유아학비 지원산모&middot;신생아&nbsp;건강관리&nbsp;지원-&nbsp;산모 또는 배우자가 국민기초생활 보장법에 따른 생계&middot;의료&middot;주거&middot;교육급여 수급자 또는 차상위 계층에 해당하는 출산가정 등을 대상으로 산모 및 신생아의 건강관리 돌봄서비스 제공 기저귀&middot;조제분유&nbsp;지원- 보건복지부 지원대상 가구의 기저귀, 조제분유 구매 지원사업(만 2세 미만 영아 대상, 보건소를 통한 바우처 신청 후 지원결정 통보 익일부터 바우처 사용 가능)여성청소년&nbsp;위생용품&nbsp;바우처&nbsp;지원- 차상위계층 등의 여성청소년을 대상으로 위생용품 구입비용을 지원하는 바우처기타&nbsp;사회&nbsp;서비스&nbsp;사업- 노인 돌봄 종합 서비스, 장애인 활동지원 등 기타 사회 서비스 사업에너지&nbsp;바우처&nbsp;지원- 에너지 취약 계층의 전기, 난방비 등을 지원하는 산업통상자원부 바우처 사업아이돌봄&nbsp;서비스&nbsp;지원- 가정의 아이돌봄을 지원하여 아이 및 보호자의 복지 증진을 위한 바우처 사업* 바우처에 대한 세부 설명은 http://www.voucher.go.kr 에서 확인 가능합니다."]], company: "BC CARD"),
        Card(cardId: "1278", image: Image("card2"), title: "국민행복카드", content:
                [["14":"건강 보험 임신&middot;출산 진료비 지원- 임신 &middot; 출산이 확인된 건강보험 가입자 또는 피부양자 등에게 임신과 출산에 관련된 진료 비용 60만원(다태아:100만원) 지원청소년산모 임신&middot;출산 의료비 지원&nbsp;- 만 18세 이하 산모 대상으로 임신과 출산에 관련된 진료 비용 지원보육료&middot;유아학비&nbsp;지원- 만 0세부터 5세 아동 대상 어린이집, 유치원 보육료 및 유아학비 지원산모&middot;신생아&nbsp;건강관리&nbsp;지원-&nbsp;산모 또는 배우자가 국민기초생활 보장법에 따른 생계&middot;의료&middot;주거&middot;교육급여 수급자 또는 차상위 계층에 해당하는 출산가정 등을 대상으로 산모 및 신생아의 건강관리 돌봄서비스 제공 기저귀&middot;조제분유&nbsp;지원- 보건복지부 지원대상 가구의 기저귀, 조제분유 구매 지원사업(만 2세 미만 영아 대상, 보건소를 통한 바우처 신청 후 지원결정 통보 익일부터 바우처 사용 가능)여성청소년&nbsp;위생용품&nbsp;바우처&nbsp;지원- 차상위계층 등의 여성청소년을 대상으로 위생용품 구입비용을 지원하는 바우처기타&nbsp;사회&nbsp;서비스&nbsp;사업- 노인 돌봄 종합 서비스, 장애인 활동지원 등 기타 사회 서비스 사업에너지&nbsp;바우처&nbsp;지원- 에너지 취약 계층의 전기, 난방비 등을 지원하는 산업통상자원부 바우처 사업아이돌봄&nbsp;서비스&nbsp;지원- 가정의 아이돌봄을 지원하여 아이 및 보호자의 복지 증진을 위한 바우처 사업* 바우처에 대한 세부 설명은 http://www.voucher.go.kr 에서 확인 가능합니다."]], company: "KB"),
        Card(cardId: "1278", image: Image("card2"), title: "국민행복카드", content:
                [["14":"건강 보험 임신&middot;출산 진료비 지원- 임신 &middot; 출산이 확인된 건강보험 가입자 또는 피부양자 등에게 임신과 출산에 관련된 진료 비용 60만원(다태아:100만원) 지원청소년산모 임신&middot;출산 의료비 지원&nbsp;- 만 18세 이하 산모 대상으로 임신과 출산에 관련된 진료 비용 지원보육료&middot;유아학비&nbsp;지원- 만 0세부터 5세 아동 대상 어린이집, 유치원 보육료 및 유아학비 지원산모&middot;신생아&nbsp;건강관리&nbsp;지원-&nbsp;산모 또는 배우자가 국민기초생활 보장법에 따른 생계&middot;의료&middot;주거&middot;교육급여 수급자 또는 차상위 계층에 해당하는 출산가정 등을 대상으로 산모 및 신생아의 건강관리 돌봄서비스 제공 기저귀&middot;조제분유&nbsp;지원- 보건복지부 지원대상 가구의 기저귀, 조제분유 구매 지원사업(만 2세 미만 영아 대상, 보건소를 통한 바우처 신청 후 지원결정 통보 익일부터 바우처 사용 가능)여성청소년&nbsp;위생용품&nbsp;바우처&nbsp;지원- 차상위계층 등의 여성청소년을 대상으로 위생용품 구입비용을 지원하는 바우처기타&nbsp;사회&nbsp;서비스&nbsp;사업- 노인 돌봄 종합 서비스, 장애인 활동지원 등 기타 사회 서비스 사업에너지&nbsp;바우처&nbsp;지원- 에너지 취약 계층의 전기, 난방비 등을 지원하는 산업통상자원부 바우처 사업아이돌봄&nbsp;서비스&nbsp;지원- 가정의 아이돌봄을 지원하여 아이 및 보호자의 복지 증진을 위한 바우처 사업* 바우처에 대한 세부 설명은 http://www.voucher.go.kr 에서 확인 가능합니다."]], company: "KB")
    ]
    
    @Published var swipedCard = 0
    
    // Detail Content....
    
    @Published var showCard = false
    @Published var selectedCard = Card(cardId: "", image: Image("DefaultCardImage"), title: "", content: [], company: "")
    @Published var selectedColor : Color = .clear
    @Published var showContent = false
    
    
}
